
## Plan Result (prod)




<pre><code>Plan: 3 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.prl-citizen-frontend-secondary-session-storage.azurerm_private_endpoint.this[0]
  * module.prl-citizen-frontend-secondary-session-storage.azurerm_redis_cache.redis
  * module.prl-citizen-frontend-secondary-session-storage.azurerm_resource_group.cache-resourcegroup[0]
* Update
  * azurerm_key_vault_secret.redis_access_key


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis_access_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "redis_access_key" {
        id                      = "https://prl-prod.vault.azure.net/secrets/redis-access-key/220c41a015954e87b80d464db8cae083"
        name                    = "redis-access-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.prl-citizen-frontend-secondary-session-storage.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "prl-citizen-frontend-secondary-redis-prod"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "prl-citizen-frontend-secondary-redis-cache-prod"
      + subnet_id                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/core-infra-prod/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-prod/subnets/core-infra-subnet-2-prod"
      + tags                     = {
          + "application"         = "family-private-law"
          + "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#prl-tech-notifications"
          + "environment"         = "production"
          + "managedBy"           = "Private Law"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "redis-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "prl-citizen-frontend-secondary-redis-prod"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.prl-citizen-frontend-secondary-session-storage.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "prl-citizen-frontend-secondary-redis-prod"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = false
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "prl-citizen-frontend-secondary-redis-cache-prod"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "application"         = "family-private-law"
          + "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#prl-tech-notifications"
          + "environment"         = "production"
          + "managedBy"           = "Private Law"
        }

      + redis_configuration {
          + data_persistence_authentication_method = "SAS"
          + enable_authentication                  = true
          + maxclients                             = (known after apply)
          + maxfragmentationmemory_reserved        = 642
          + maxmemory_delta                        = 642
          + maxmemory_policy                       = "volatile-lru"
          + maxmemory_reserved                     = 642
        }
    }

  # module.prl-citizen-frontend-secondary-session-storage.azurerm_resource_group.cache-resourcegroup[0] will be created
  + resource "azurerm_resource_group" "cache-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "prl-citizen-frontend-secondary-redis-cache-prod"
      + tags     = {
          + "application"         = "family-private-law"
          + "builtFrom"           = "https://github.com/HMCTS/prl-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#prl-tech-notifications"
          + "environment"         = "production"
          + "managedBy"           = "Private Law"
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":42,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->